blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
UPDATE "articles" SET "title" = 'Rails is Awesome!', "body" = 'It really is.', "updated_at" = '2024-11-21 18:32:30.216780' WHERE "articles"."id" = 1
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)