blog/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES ('A fellow dev', 'I agree!!!', 1, '2024-11-23 20:33:45.363459', '2024-11-23 20:33:45.363459', 'public') RETURNING "id"
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)